tutorials/immersedBoundary/cylinderInChannelScalarTransport/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1   -0.5 0)
    (2   -0.5 0)
    (2   0.5 0)
    (-1   0.5 0)
    (-1   -0.5 0.1)
    (2   -0.5 0.1)
    (2   0.5 0.1)
    (-1   0.5 0.1)
);

blocks
(
//     hex (0 1 2 3 4 5 6 7) (150 50 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (75 25 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch in
    (
        (0 4 7 3)
    )
    patch out
    (
        (2 6 5 1)
    )
    patch top
    (
        (3 7 6 2)
    )
    patch bottom
    (
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
