tutorials/immersedBoundary/cylinderInChannelScalarTransport/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }

    T
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-08;
        relTol           0;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
